#+TAGS: CLOCKIN(k) SUDO(s) CLIPBOARD(c) TRUNCATE(e)
#+SEQ_TODO: TODO TEST DONE
** Other
#+NAME: wrap
#+BEGIN_SRC elisp :var snippet="" :var process="" :var file="" :var post=post_cmd[0](process,file)
  (with-temp-buffer
    (insert "#+NAME: ")
    (insert snippet)
    (insert "\n")
    (insert "#+BEGIN_SRC python :session :noweb yes")
    (insert post)
    (insert "\n")
    (insert "\"\"\"\n<<")
    (insert snippet)
    (insert ">>\n\"\"\"\n")
    (insert "#+END_SRC")
    (buffer-string))
#+END_SRC

#+BEGIN_SRC elisp :var snippet="abc" :var process="txt" :var file="abc.txt" :var post=post_cmd[0] :restuls output
  (with-temp-buffer
    (cond  ((eq process  "aync")
              (concat snippet "_" "aync")
              (concat post ":post cmdaync(*this*)"))
             ((eq process  "fwrite" )
              (concat snippet "_" "aync")
              (concat ":post fwrite("  "\"" file "\"" "," "*this*"))
             (t (concat snippet "_" "txt")))
    (insert snippet)
    (insert "\n")
    (insert post)(buffer-string))
#+END_SRC

#+RESULTS:
: abc


#+NAME: wrap
#+BEGIN_SRC js :var snippet="abc" :var process="txt" :var file="del" :var post=""  :results raw
  var gen_post = function () {
      if (process === "aync") {
          return ":post " + "cmdaync" +  "(" + "*this*" + ")";
      }
      if (process === "fwrite"){
          return ":post " + "fwrite" + "(" + '"' +  file + '"' + "," + "*this*" + ")";
      }
      return post;
  };
  var code = "#+NAME: " + snippet + "_" + process + "\n";
  code = code + "#+BEGIN_SRC python :session :noweb yes "  + gen_post() + "\n";
  code = code + '"""<<' + snippet + '>>"""' + "\n";
  code = code + "#+END_SRC";
  console.log(code);
  return 0;
#+END_SRC

#+RESULTS: wrap
#+NAME: abc_txt
#+BEGIN_SRC python :session :noweb yes
"""<<abc>>"""
#+END_SRC


#+BEGIN_SRC elisp :var a="add" :var b="aync" :noweb yes
  (with-temp-buffer
    (insert <<post_cmd[0]("A","aync")>>)
    (buffer-string)
    )
    (insert "#+BEGIN_SRC python :session :noweb yes")

#+END_SRC

#+RESULTS:
:
: undefined hello

call_post_cmd("A","aync")

